In [43]:
import numpy as np 
import pandas as pd

## 1-D Array

In [44]:
my_list = [11, 13, 15]
my_list                  # [11, 13, 15]
np.array([11, 13, 15])   # array([11, 13, 15])

array([11, 13, 15])

In [45]:
x = np.array([11, 13, 15, 16])
x.shape

(4,)

In [46]:
x[1]
type(x) # numpy.ndarray
type(my_list) # list

list

In [47]:
print(type(x.shape)) # this will be a tuple
print(len(x.shape)) # this will show length of the tuple

<class 'tuple'>
1

In [48]:
a = (3, 4)
print(type(a)) # tuple
print(len(a)) # 2

<class 'tuple'>
2

## 2-D Arrays

In [49]:
my_2d_list = [[1,2] , [3,4] , [5,6]] 
my_2d_list

[[1, 2], [3, 4], [5, 6]]

In [50]:
y = np.array(my_2d_list)
y

array([[1, 2],
       [3, 4],
       [5, 6]])

In [51]:
print(y)

[[1 2]
 [3 4]
 [5 6]]

In [52]:
# We can access using index
y[2]   # [5, 6] 
y[0,0] # y[0][0]   same result: 1
y[2,1] # y[2][1]   same result: 6

np.int64(6)

In [53]:
# Create a 2-d array with data 

y = [[1, 2, 3],
     [4, 5, 6],
     [7, 8, 9]]


z = [[10,20,30,40],
      [50, 60, 70, 80],
      [90, 100, 110, 120]] 


print(z[1][3]) # 80
print(y[0][1]) # 2
print(z[2][2]) # 110

80
2
110

In [83]:
# Create a 3-d array with data

n = [ [[1,2,3],
       [4,5,6]],
     
     [[23, 24, 25],
      [26, 27, 28]],

     [[66,65,64],
      [63,62,61]]
    ]
       

m = [
    
    [[1,2,3],
     [4,5,6]],
    
      [[10,20,30],
      [40,50,60]],
    
     [[100,200,300],
      [400,500,600]]
]

assert m[0][0][0] == 1
assert m[1][1][0] == 40
assert m[0][0][1] == 2
assert m[2][1][2] == 600
assert n[2][0][0] == 66
assert n[0][1][2] == 6
assert m[-2:-1][0] == [[10,20,30], [40,50,60]]
assert m[-1][0:] == [[100, 200, 300], [400, 500, 600]]

# m[-1:-2][0] # IndexError: list index out of range

assert m[-2:-1][0] ==  [[10,20,30],[40,50,60]]
# m[-2:-1] gets [ [[ 10,20,30], [40,50,60]] ] --[0]--> [[10,20,30],[40,50,60]]

assert m[-1][0] == [100,200,300]

assert m[-1:][0] == [[100, 200, 300], [400, 500, 600]]   
# m[-1:] gets [ [[100,200,300],[400,500,600]] ] --[0]--> [[100, 200, 300], [400, 500, 600]]   

assert m[-1:][:0] == [] 
assert m[-1:][0:] == [[[100, 200, 300], [400, 500, 600]]]
# m[-1:] gets [ [[100,200,300],[400,500,600]] ] -->[0:] --> gets the exact same thing

In [84]:
# Crud - create, read, update, delete  ---- we created lists above already 


# -------- read
# Accessing a row 
# my_2d_list = [[1,2] , [3,4] , [5,6]] 

my_2d_list[:][2] # [5, 6]
my_2d_list[2][0] # 5
m[-2:-1][0] # [[10, 20, 30], [40, 50, 60]]
my_2d_list[:][0] # [1, 2]

[1, 2]

In [56]:
# -------- update

my_2d_list[2][1] = 444
my_2d_list

[[1, 2], [3, 4], [5, 444]]

In [57]:
arr1 = np.array([[1, 2], [3, 4], [5, 6]])
arr2 = np.array([[7, 8]])
arr3 = np.append(arr1, arr2) # It returns a new array. It doesn't add arr2 to arr1.
arr3

array([1, 2, 3, 4, 5, 6, 7, 8])

In [58]:
print(arr3.shape) # Will get (8,)
arr4 = arr3.reshape(4, 2) # It doesn't change arr3, but use data to make a new array
print(arr3)
print('---')
print(arr4)

(8,)
[1 2 3 4 5 6 7 8]
---
[[1 2]
 [3 4]
 [5 6]
 [7 8]]

In [59]:
# delete - we cannot delete existing items
# np.delete(array, index, axis)
# axis 0 is along rows, axis 1 is along the columns

arr1 = np.array([[1, 2], [3, 4], [5, 6], [7, 8]])

# we want to delete row [5,6], it is in row of index[2] axis 0

arr2 = np.delete(arr1, 2, 0)
arr2

array([[1, 2],
       [3, 4],
       [7, 8]])

In [60]:
# delete column 2 4 6 8
arr3 = np.delete(arr1, 1, 1)
arr3

array([[1],
       [3],
       [5],
       [7]])

In [61]:
print(arr1)
print('---')
print(arr3)

[[1 2]
 [3 4]
 [5 6]
 [7 8]]
---
[[1]
 [3]
 [5]
 [7]]

## Some Useful Functions

In [62]:
# np.arange() acts like the range function of python 
# create arrays with evenly spaces values
arr1 = np.arange(0, 10)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [86]:
arr2 = np.arange(0, 10, 4) # (start, end, step)
arr = np.arange(12, 20, 3) # array([12,15,18])
arr2
print(arr3) # Notice: When we do print, the comma disappears

[12 15 18]

In [89]:
arr3 = np.zeros(3)
arr4 = np.zeros((3,4)) # double parentheses necessary 
arr5 = np.ones((3,4))
arr6 = np.identity(3)
print(arr3)
print('---------------')
print(arr4)
print('---------------')
print(arr5)
print('---------------')
print(arr6)

[0. 0. 0.]
---------------
[[0. 0. 0. 0.]
 [0. 0. 0. 0.]
 [0. 0. 0. 0.]]
---------------
[[1. 1. 1. 1.]
 [1. 1. 1. 1.]
 [1. 1. 1. 1.]]
---------------
[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]

In [91]:
arr7 = np.eye(3)
arr8 = np.eye(5, k=1)
arr9 = np.eye(7, k=-1)
arr10 = np.eye(4,5)

print(arr7)
print(arr8)
print(arr9)
print(arr10)

[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]
[[0. 1. 0. 0. 0.]
 [0. 0. 1. 0. 0.]
 [0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 1.]
 [0. 0. 0. 0. 0.]]
[[0. 0. 0. 0. 0. 0. 0.]
 [1. 0. 0. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0. 0. 0.]
 [0. 0. 1. 0. 0. 0. 0.]
 [0. 0. 0. 1. 0. 0. 0.]
 [0. 0. 0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0. 1. 0.]]
[[1. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0.]
 [0. 0. 1. 0. 0.]
 [0. 0. 0. 1. 0.]]

In [96]:
arr9 = np.random.rand(3, 2)
print(arr9)

p = np.random.randint(0, 100, 30) # range of 0 to 100, 30 numbers in the array
print(p)

[[0.20870519 0.75919257]
 [0.98064833 0.94598075]
 [0.44181754 0.3684943 ]]
[31 25 80 82 55 15 95 65 34 20  4 92 67 42 19 89 42 44 17 51 75 30 24 62
 76 79 68  9 84 72]

In [100]:
p.reshape(3,10)
p

array([31, 25, 80, 82, 55, 15, 95, 65, 34, 20,  4, 92, 67, 42, 19, 89, 42,
       44, 17, 51, 75, 30, 24, 62, 76, 79, 68,  9, 84, 72])

In [102]:
print(p.min()) # 4
print(p.max()) # 95
print(p.argmin()) # 10 - indice of the minimum number 
print(p.argmax()) # 6 indice of the maximum number

4
95
10
6

## Operations with matrices

In [69]:
# adding - basically works like append here
a = [1, 3, 5]
b = [20, 30 , 40]
a + b

[1, 3, 5, 20, 30, 40]

In [70]:
# adding arrays, however, leads to a proper addition 
d = np.array([1, 3, 5])
e = np.array([10, 100, 1000])
d + e

array([  11,  103, 1005])

In [71]:
# if the dimensions are not the same, we get an error message
d = np.array([1, 3, 5])
e = np.array([10, 100, 1000, 10000])
d + e

ValueError: operands could not be broadcast together with shapes (3,) (4,)

In [106]:
f = np.array(["ha", "ho"])
g = np.array(["hey", "how"])
h = np.append(f, g)
h

array(['ha', 'ho', 'hey', 'how'], dtype='<U3')

## multiply

## Multiply with the matrix

In [107]:
m = np.array([1,2,3])
m*2

array([2, 4, 6])

In [108]:
[2,4,6] * 3 #since its not written as an array anymore, the output changes

[2, 4, 6, 2, 4, 6, 2, 4, 6]

In [109]:
i = np.array([1,2,3,4])
i*i

array([ 1,  4,  9, 16])

In [110]:
[1,  4,  9, 16] * [1,  4,  9, 16] # type error

TypeError: can't multiply sequence by non-int of type 'list'

In [111]:
[1,  4,  9, 16] * 2

[1, 4, 9, 16, 1, 4, 9, 16]

# Pandas

## 1. Pandas - Series

In [112]:
name = ["Abby", "Dylan", "Hope"]
num = [12, 15, 13]
num_arr = np.array(num)
dct = {"Abby" : 12, "Dylan" : 15, "Hope" : 13}

In [113]:
series1 = pd.Series(num)
series1

0    12
1    15
2    13
dtype: int64

In [114]:
series1 = pd.Series(num, index = name)
series1

Abby     12
Dylan    15
Hope     13
dtype: int64

In [115]:
series1.shape

(3,)

In [116]:
# we can also create a series from a numpy array
series2 = pd.Series(num_arr, name) 
series2

Abby     12
Dylan    15
Hope     13
dtype: int64

In [117]:
# we can create a series from a dictionary
series3 = pd.Series(dct)
series3

Abby     12
Dylan    15
Hope     13
dtype: int64

In [118]:
lst = [2.45, 3.67, 4.97]
lst_s = pd.Series(lst)
print(lst_s)
print(lst_s[0]) # 2.45
print(lst_s[2]) # 4.97

0    2.45
1    3.67
2    4.97
dtype: float64
2.45
4.97

In [119]:
s5 = pd.Series([22, 33, 44], ['One', 'Two', 'Three']) # (data, index)
s5

One      22
Two      33
Three    44
dtype: int64

In [120]:
# another way to access the data is through the named index itself
print(s5['One'])
print(s5['Three'])

22
44

In [122]:
s77 = pd.Series(data=[22, 25, 27] , index=[5, 7, 9])
print(s77)
print(s77[5])
print(s77[0]) # Key error since Pandas thinks that [0] is an index and we dont have that index name

5    22
7    25
9    27
dtype: int64
22

KeyError: 0

In [123]:
# to access a position without using the index name
print(s77.iloc[0]) # use iloc[] instead 
print(s77.iloc[1])

22
25

In [125]:
s8 = pd.Series([22, 25, 27], ['H', 'A', 'Y'])
s8

H    22
A    25
Y    27
dtype: int64

In [126]:
# changing the value 
s8['H'] = 23 
s8

H    23
A    25
Y    27
dtype: int64

In [127]:
# appending a value
s8['S'] = 29
s8['E'] = 31
s8

H    23
A    25
Y    27
S    29
E    31
dtype: int64

In [128]:
s9 = s8.drop(['S', 'E']) # s8.drop(labels = ['S', 'E'])
print(s8)
print('---------------')
print(s9)

H    23
A    25
Y    27
S    29
E    31
dtype: int64
---------------
H    23
A    25
Y    27
dtype: int64

In [129]:
# Operations 

s1 = pd.Series([11,22,33])
s2 = pd.Series([11,22,33])
s1 + s2

0    22
1    44
2    66
dtype: int64

In [130]:
# Adds the value in accordance with the name of the index itself, 
# which is why we have no values for 'C' and 'D' since only one of the series contains the letters while both s3 and s4 have 'A' and 'B'
s3 = pd.Series([11,22,33], ['A', 'B', 'C'])
s4 = pd.Series([11,22,33], ['B', 'D', 'A'])
s3 + s4

A    44.0
B    33.0
C     NaN
D     NaN
dtype: float64

## Pandas - DataFrame

In [131]:
df = pd.DataFrame({
    'Gold' : [15, 20,15],
    'Silver' : [ 22, 66, 7],
    'Bronze' : [23, 2, 23],
    'Continent' : ['Europe', 'Asia', 'Asia']
     }, 
     [ 'France' , 'Thailand' , 'Vietnam'])

df

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia

In [133]:
# we can create them separately as well 
my_dt = {
    'Gold' : [15, 20,15],
    'Silver' : [ 22, 66, 7],
    'Bronze' : [23, 2, 23],
    'Continent' : ['Europe', 'Asia', 'Asia']}

my_dt2 = ['France' , 'Thailand' , 'Vietnam']

df = pd.DataFrame(my_dt, my_dt2)
df

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia

In [138]:
# Create a dataframe by manually setting each column with a series.
df3 = pd.DataFrame()
ser1 = pd.Series([15, 20, 15])
ser2 = pd.Series([22, 66, 7])
ser3 = pd.Series([23, 2, 23])
ser4 = pd.Series(['Europe', 'Asia', 'Asia'])

df3['Gold'] = ser1
df3['Silver'] = ser2
df3['Bronze'] = ser3
df3['Continent'] = ser4

df3

   Gold  Silver  Bronze Continent
0    15      22      23    Europe
1    20      66       2      Asia
2    15       7      23      Asia

In [139]:
# what about the index?

my_ind = pd.Series(['France', 'Thailand', 'Vietnam'])

df33 = df3.set_index(my_ind) 
print(df33)
print('----------------------')
print(df3)

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia
----------------------
   Gold  Silver  Bronze Continent
0    15      22      23    Europe
1    20      66       2      Asia
2    15       7      23      Asia

In [140]:
# still, if we call df3, it will show us the dataframe with no index naming. Hence, we use inplace = True to make permanent changes
df3.set_index(my_ind, inplace = True)
df3

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia

In [141]:
# Now, if we print both df3 and df33, we get the same result 
print(df33)
print('----------------------')
print(df3)

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia
----------------------
          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia

## Reading - subsetting columns, subsetting rows, acessing any particular element

In [142]:
# accessing 
df['Continent'] # df['Continent'] -> pandas.core.series.Series

France      Europe
Thailand      Asia
Vietnam       Asia
Name: Continent, dtype: object

In [143]:
# accessing 
df[['Continent']] # df['Continent'] -> pandas.core.series.Dataframe

         Continent
France      Europe
Thailand      Asia
Vietnam       Asia

In [144]:
df[['Gold' , 'Continent']]

          Gold Continent
France      15    Europe
Thailand    20      Asia
Vietnam     15      Asia

In [146]:
# subsetting rows
df.loc[0] # since our dataframe has countries as index and not [0,1,2], shows key error

In [151]:
# which is why we use iloc instead 
df.iloc[0] # returns a series
df.iloc[[0]] # returns a dataframe

        Gold  Silver  Bronze Continent
France    15      22      23    Europe

In [152]:
df.iloc[1:3] #df.loc[1:3] wont work

          Gold  Silver  Bronze Continent
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia

In [155]:
df.loc['Thailand'] # since now we used the name of our index, it works! - shows in series

Gold           20
Silver         66
Bronze          2
Continent    Asia
Name: Thailand, dtype: object

In [157]:
df.loc[['Thailand']] # - shows in dataframe
df.loc[['Thailand', 'France']]

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia
Vietnam     15       7      23      Asia

In [172]:
# Both rows and columns
df.iloc[2, 0:2] # 2nd row, first two columns but in series
df.iloc[[2], 0:2] # same but in dataframe

         Gold  Silver
Vietnam    15       7

In [179]:
# all these are gonna be in dataframes since we have : for rows

df.iloc[:,:] # all rows, all columns
df.iloc[:,1:-1] # all columns excceot the zeroth and the last
df.iloc[:2, [0,3]] # only the 0th and 3rd column
df.iloc[:2, :] # only the 0th and 1st row and all columns

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20      66       2      Asia

In [180]:
x = df.iloc[2]
x # type - series

Gold           15
Silver          7
Bronze         23
Continent    Asia
Name: Vietnam, dtype: object

In [ ]:
x.iloc[1, 2] # IndexError: too many indexes

In [166]:
x.iloc[2] # type - numpy.int64

np.int64(23)

In [168]:
x.iloc[[2]] # type - series

Bronze    23
Name: Vietnam, dtype: object

In [ ]:
x.iloc[[2], [2]] # Indexing Error

In [170]:
df.iloc[2,1] # 2nd row, 1st column number -->  7 (keep in mind: its a comma, not :
df.iloc[2] # 2nd row but in series

Gold           15
Silver          7
Bronze         23
Continent    Asia
Name: Vietnam, dtype: object

In [182]:
# How to update values
# using iloc
df.iloc[2,2] = 17 # updates df[2nd row, 2nd column] to be 17
df

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20       8       2      Asia
Vietnam     15       7      17      Asia

In [181]:
# using loc
df.loc['Thailand', 'Silver'] = 8
df # here, we used loc instead to access the index

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20       8       2      Asia
Vietnam     15       7      23      Asia

In [191]:
# appending
dfplus = pd.DataFrame(
    {
        'Gold' : [5],
        'Silver' : [2],
        'Bronze' : [8],
        'Continent' : ['Europe']
    },
    ['England'])
dfplus

         Gold  Silver  Bronze Continent
England     5       2       8    Europe

In [186]:
df3 = pd.concat([df, dfplus])
df3

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20       8       2      Asia
Vietnam     15       7      17      Asia
England      5       2       8    Europe

In [ ]:
df # stays the same

In [187]:
df3['Abbreviation'] = pd.Series(['FR', 'TH' , 'CN', 'UK'], index = df3.index)
df3

          Gold  Silver  Bronze Continent Abbreviation
France      15      22      23    Europe           FR
Thailand    20       8       2      Asia           TH
Vietnam     15       7      17      Asia           CN
England      5       2       8    Europe           UK

In [188]:
df3['Abbreviation'] = pd.Series(['FR', 'TH' , 'CN', 'UK'])
df3 # Nan values only

          Gold  Silver  Bronze Continent Abbreviation
France      15      22      23    Europe          NaN
Thailand    20       8       2      Asia          NaN
Vietnam     15       7      17      Asia          NaN
England      5       2       8    Europe          NaN

In [189]:
# Delete rows
df3 = df3.drop("England")
df3

          Gold  Silver  Bronze Continent Abbreviation
France      15      22      23    Europe          NaN
Thailand    20       8       2      Asia          NaN
Vietnam     15       7      17      Asia          NaN

In [190]:
# preserve a copy if you wanna make changes
df4 = df3.copy()
df4

          Gold  Silver  Bronze Continent Abbreviation
France      15      22      23    Europe          NaN
Thailand    20       8       2      Asia          NaN
Vietnam     15       7      17      Asia          NaN

In [ ]:
# axis 0 -> rows
# axis 1 -> columns

df4.drop("France", inplace = True)
df4

In [193]:
df5 = df.copy()
df5

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20       8       2      Asia
Vietnam     15       7      17      Asia

In [194]:
df5 = df5.drop('Thailand', axis = 0)
# wont work on axis = 1 since 'Thailand'is a row name and not a column name 
df5 = df5.drop('Silver', axis= 1)
df5

         Gold  Bronze Continent
France     15      23    Europe
Vietnam    15      17      Asia

In [195]:
df # remains the same

          Gold  Silver  Bronze Continent
France      15      22      23    Europe
Thailand    20       8       2      Asia
Vietnam     15       7      17      Asia

In [196]:
# for columns
df6 = df.copy()
df6.drop('Gold', axis = 1, inplace = True)
df6

          Silver  Bronze Continent
France        22      23    Europe
Thailand       8       2      Asia
Vietnam        7      17      Asia

In [197]:
df7 = df.copy()
df7.drop("France", inplace=True)
df7

          Gold  Silver  Bronze Continent
Thailand    20       8       2      Asia
Vietnam     15       7      17      Asia

# Data Manipulation

In [198]:
df1 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/muic1.csv")
df2 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/muic2.csv")
df3 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/muic3.csv")

In [199]:
df1

        ID            Name  Major  GPA
0  6780001      Ann Molive   ICCH  3.2
1  6780002      Ben Kenobi   ICJD  NaN
2  6780003   Peter Cruiser   ICBA  3.3
3  6780004      Bob Hanger   ICFS  3.5
4  6780005        Moe Otto   ICCS  3.1

In [200]:
df2

        ID         Name  Major  GPA
0  6780031      Tom Lee   ICCS  2.7
1  6780032     Pat Cade   ICFS  3.8
2  6780033   Will Power   ICBA  2.7
3  6780034   Arty Didas   ICFS  3.2
4  6780035    Bart Yolo   ICCS  1.7

In [201]:
df3

        ID               Name  Major  GPA
0  6780021         Terry Cuda   ICCS  1.9
1  6780022        Justin Bull   ICBA  2.8
2  6780023       Ed Cheerbeer   ICCS  4.0
3  6780024          Luke Warm   ICCS  1.2
4  6780025   Anakin Skywalker   ICJD  NaN

In [202]:
row_concat1 = pd.concat([df1, df2, df3])
row_concat1.shape

(15, 4)

In [203]:
row_concat1

        ID               Name  Major  GPA
0  6780001         Ann Molive   ICCH  3.2
1  6780002         Ben Kenobi   ICJD  NaN
2  6780003      Peter Cruiser   ICBA  3.3
3  6780004         Bob Hanger   ICFS  3.5
4  6780005           Moe Otto   ICCS  3.1
0  6780031            Tom Lee   ICCS  2.7
1  6780032           Pat Cade   ICFS  3.8
2  6780033         Will Power   ICBA  2.7
3  6780034         Arty Didas   ICFS  3.2
4  6780035          Bart Yolo   ICCS  1.7
0  6780021         Terry Cuda   ICCS  1.9
1  6780022        Justin Bull   ICBA  2.8
2  6780023       Ed Cheerbeer   ICCS  4.0
3  6780024          Luke Warm   ICCS  1.2
4  6780025   Anakin Skywalker   ICJD  NaN

In [204]:
# we want to subset the 4th student out 
row_concat1.loc[3]
# but there are many rows in index 3 since they all match the label

        ID         Name  Major  GPA
3  6780004   Bob Hanger   ICFS  3.5
3  6780034   Arty Didas   ICFS  3.2
3  6780024    Luke Warm   ICCS  1.2

In [205]:
# to get the 4th row, we use iloc since iloc is the integer location
row_concat1.iloc[[3]] # [3] for dataframe

        ID         Name  Major  GPA
3  6780004   Bob Hanger   ICFS  3.5

In [206]:
# getting a better index
row_concat2 = pd.concat([df1, df2, df3], ignore_index = True)
row_concat2

         ID               Name  Major  GPA
0   6780001         Ann Molive   ICCH  3.2
1   6780002         Ben Kenobi   ICJD  NaN
2   6780003      Peter Cruiser   ICBA  3.3
3   6780004         Bob Hanger   ICFS  3.5
4   6780005           Moe Otto   ICCS  3.1
5   6780031            Tom Lee   ICCS  2.7
6   6780032           Pat Cade   ICFS  3.8
7   6780033         Will Power   ICBA  2.7
8   6780034         Arty Didas   ICFS  3.2
9   6780035          Bart Yolo   ICCS  1.7
10  6780021         Terry Cuda   ICCS  1.9
11  6780022        Justin Bull   ICBA  2.8
12  6780023       Ed Cheerbeer   ICCS  4.0
13  6780024          Luke Warm   ICCS  1.2
14  6780025   Anakin Skywalker   ICJD  NaN

### Adding a dataframe where columns are not identical

In [207]:
# Case 1: A subset
narrower_df = pd.DataFrame({
    "ID" : [6781111, 6781112],
    "Name" : ["Jacky Chow", "Jet Loo"]
})
narrower_df

        ID        Name
0  6781111  Jacky Chow
1  6781112     Jet Loo

In [208]:
# Major and GPA show NaN values 
dfx = pd.concat([df1, narrower_df])
dfx

        ID            Name  Major  GPA
0  6780001      Ann Molive   ICCH  3.2
1  6780002      Ben Kenobi   ICJD  NaN
2  6780003   Peter Cruiser   ICBA  3.3
3  6780004      Bob Hanger   ICFS  3.5
4  6780005        Moe Otto   ICCS  3.1
0  6781111      Jacky Chow    NaN  NaN
1  6781112         Jet Loo    NaN  NaN

In [209]:
# Case 2: creating a dataframe with totally different columns
another_df = pd.DataFrame({
    "Hobby" : ["Reading", "Running"],
    "Club" : ["Board Game", "Debate"]
})
another_df

     Hobby        Club
0  Reading  Board Game
1  Running      Debate

In [210]:
dfy = pd.concat([df1, another_df])
dfy

          ID            Name  Major  GPA    Hobby        Club
0  6780001.0      Ann Molive   ICCH  3.2      NaN         NaN
1  6780002.0      Ben Kenobi   ICJD  NaN      NaN         NaN
2  6780003.0   Peter Cruiser   ICBA  3.3      NaN         NaN
3  6780004.0      Bob Hanger   ICFS  3.5      NaN         NaN
4  6780005.0        Moe Otto   ICCS  3.1      NaN         NaN
0        NaN             NaN    NaN  NaN  Reading  Board Game
1        NaN             NaN    NaN  NaN  Running      Debate

In [211]:
# case 3: some columns are the same
foo_df = pd.DataFrame({
    "ID" : [6780101, 6780102],
    "Major" : ["ICCH", "ICCS"],
    "Height" : [65, 59],
    "Weight" : [170, 180]})
foo_df

        ID Major  Height  Weight
0  6780101  ICCH      65     170
1  6780102  ICCS      59     180

In [212]:
dfz = pd.concat([df1, foo_df])
dfz

        ID            Name  Major  GPA  Height  Weight
0  6780001      Ann Molive   ICCH  3.2     NaN     NaN
1  6780002      Ben Kenobi   ICJD  NaN     NaN     NaN
2  6780003   Peter Cruiser   ICBA  3.3     NaN     NaN
3  6780004      Bob Hanger   ICFS  3.5     NaN     NaN
4  6780005        Moe Otto   ICCS  3.1     NaN     NaN
0  6780101             NaN   ICCH  NaN    65.0   170.0
1  6780102             NaN   ICCS  NaN    59.0   180.0

In [213]:
# inner join - is structural - looks for columns that are in both the dataframes
dfz = pd.concat([df1, foo_df], join = "inner")
dfz

        ID  Major
0  6780001   ICCH
1  6780002   ICJD
2  6780003   ICBA
3  6780004   ICFS
4  6780005   ICCS
0  6780101   ICCH
1  6780102   ICCS

In [214]:
# lets give our 0th index a nan value in major 
df1.loc[0, "Major"] = np.nan
df1

        ID            Name  Major  GPA
0  6780001      Ann Molive    NaN  3.2
1  6780002      Ben Kenobi   ICJD  NaN
2  6780003   Peter Cruiser   ICBA  3.3
3  6780004      Bob Hanger   ICFS  3.5
4  6780005        Moe Otto   ICCS  3.1

In [216]:
# concat is based on structure and not values
dfz = pd.concat([df1, foo_df], join = "inner")
dfz

        ID  Major
0  6780001    NaN
1  6780002   ICJD
2  6780003   ICBA
3  6780004   ICFS
4  6780005   ICCS
0  6780101   ICCH
1  6780102   ICCS

In [217]:
# outer - default value of the concat function, 
# leaving it blank is the same as setting join = "outer"
dfz = pd.concat([df1, foo_df], join = "outer")
dfz

        ID            Name  Major  GPA  Height  Weight
0  6780001      Ann Molive    NaN  3.2     NaN     NaN
1  6780002      Ben Kenobi   ICJD  NaN     NaN     NaN
2  6780003   Peter Cruiser   ICBA  3.3     NaN     NaN
3  6780004      Bob Hanger   ICFS  3.5     NaN     NaN
4  6780005        Moe Otto   ICCS  3.1     NaN     NaN
0  6780101             NaN   ICCH  NaN    65.0   170.0
1  6780102             NaN   ICCS  NaN    59.0   180.0

### Adding Columns

In [218]:
# download our other files for the next tasks

df1 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/concat_1.csv")
df2 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/concat_2.csv")
df3 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/concat_3.csv")

In [219]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [220]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [221]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [222]:
row_concat = pd.concat([df1, df2, df3])
row_concat

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [223]:
# if we want to add along the column, use axis = 1
col_concat = pd.concat([df1, df2, df3], axis = 1)
col_concat

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [224]:
col_concat['A'] # gets all the A's columns

    A   A    A
0  A0  A4   A8
1  A1  A5   A9
2  A2  A6  A10
3  A3  A7  A11

In [233]:
# adding columns with different indexes
df1.columns = ['A', 'B', 'C', 'D']
df2.columns = ['D', 'E', 'F', 'G']
df3.columns = ['A', 'D', 'G', 'H']

In [234]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [227]:
df2

    D   E   F   G
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [228]:
df3

     A    D    G    H
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [235]:
# all DataFrames have column D and hence, there is not a single NaN value there
row_concat = pd.concat([df1, df2, df3])
row_concat

     A    B    C    D    E    F    G    H
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN   A4   B4   C4   D4  NaN
1  NaN  NaN  NaN   A5   B5   C5   D5  NaN
2  NaN  NaN  NaN   A6   B6   C6   D6  NaN
3  NaN  NaN  NaN   A7   B7   C7   D7  NaN
0   A8  NaN  NaN   B8  NaN  NaN   C8   D8
1   A9  NaN  NaN   B9  NaN  NaN   C9   D9
2  A10  NaN  NaN  B10  NaN  NaN  C10  D10
3  A11  NaN  NaN  B11  NaN  NaN  C11  D11

In [ ]:
# since inner only gets the common columns, we only get the D column in our result
row_concat1 = pd.concat([df1, df2, df3], join = 'inner')
row_concat1

### Situations where Such Methods are Applicable

In [236]:
# create a dataframe to be used next
addr1_df = pd.DataFrame({
    'Number' : ['114', '153/1', '102', '945'],
    'Building' : ['A', 'BeachFront', 'Main', 'C'],
    'Street' : ['Sai 1', 'Rama IX', 'Barom' , 'Yaek 9'],
    "City":["Salaya", "Payathai", "Salaya", "Aroonamarin"],
    "District":["Taweewattana", "Ratchtevee", "Taweewattana", "Bangkok Noi"],
    "Province":["Bangkok", "Bangkok", "Bangkok", "Bangkok"],
    "ZIP":[73710, 10400, 73710, 10700]})

addr1_df

  Number    Building   Street         City      District Province    ZIP
0    114           A    Sai 1       Salaya  Taweewattana  Bangkok  73710
1  153/1  BeachFront  Rama IX     Payathai    Ratchtevee  Bangkok  10400
2    102        Main    Barom       Salaya  Taweewattana  Bangkok  73710
3    945           C   Yaek 9  Aroonamarin   Bangkok Noi  Bangkok  10700

In [237]:
# Create a dataframe to be used next
addr2_df = pd.DataFrame({
    "Number":["208", "2491", "327", "123"],
    "Street":["Rama VI", "Rama I", "Sukhumvit", "Charansanitwong"],
    "City":["SamSen Nai", "Bangrug", "Prakanong", "Bangplud"],
    "District":["Phayathai", "Ratchtevee", "Taweewattana", "Bangkok Noi"],
    "Province":["Bangkok", "Bangkok", "Bangkok", "Bangkok"],
    "Country":["Thailand", "Thailand", "Thailand", "Thailand"],
    "ZIP":[10100, 10400, 10600, 10200]
})
addr2_df

  Number           Street        City      District Province   Country    ZIP
0    208          Rama VI  SamSen Nai     Phayathai  Bangkok  Thailand  10100
1   2491           Rama I     Bangrug    Ratchtevee  Bangkok  Thailand  10400
2    327        Sukhumvit   Prakanong  Taweewattana  Bangkok  Thailand  10600
3    123  Charansanitwong    Bangplud   Bangkok Noi  Bangkok  Thailand  10200

In [238]:
# we get some NaN values - not what we want
addr_df = pd.concat([addr1_df, addr2_df])
addr_df

,Number,Building,Street,City,District,Province,ZIP,Country
0,114,A,Sai 1,Salaya,Taweewattana,Bangkok,73710,NaN
1,153/1,BeachFront,Rama IX,Payathai,Ratchtevee,Bangkok,10400,NaN
2,102,Main,Barom,Salaya,Taweewattana,Bangkok,73710,NaN
3,945,C,Yaek 9,Aroonamarin,Bangkok Noi,Bangkok,10700,NaN
0,208,NaN,Rama VI,SamSen Nai,Phayathai,Bangkok,10100,Thailand
1,2491,NaN,Rama I,Bangrug,Ratchtevee,Bangkok,10400,Thailand
2,327,NaN,Sukhumvit,Prakanong,Taweewattana,Bangkok,10600,Thailand
3,123,NaN,Charansanitwong,Bangplud,Bangkok Noi,Bangkok,10200,Thailand

In [239]:
# more concise than the outer join above
addr_df = pd.concat([addr1_df, addr2_df], join = 'inner')
addr_df

  Number           Street         City      District Province    ZIP
0    114            Sai 1       Salaya  Taweewattana  Bangkok  73710
1  153/1          Rama IX     Payathai    Ratchtevee  Bangkok  10400
2    102            Barom       Salaya  Taweewattana  Bangkok  73710
3    945           Yaek 9  Aroonamarin   Bangkok Noi  Bangkok  10700
0    208          Rama VI   SamSen Nai     Phayathai  Bangkok  10100
1   2491           Rama I      Bangrug    Ratchtevee  Bangkok  10400
2    327        Sukhumvit    Prakanong  Taweewattana  Bangkok  10600
3    123  Charansanitwong     Bangplud   Bangkok Noi  Bangkok  10200

### Concatenate Columns with different rows

In [240]:
# change the row labels
df1.index = [0,1,2,3]
df2.index = [2,3,4,5]
df3.index = [2,3,6,7]

In [248]:
col_concat = pd.concat([df1, df2, df3], axis =1)
col_concat

     A    B    C    D    D    E    F    G    A    D    G    H
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2   A4   B4   C4   D4   A8   B8   C8   D8
3   A3   B3   C3   D3   A5   B5   C5   D5   A9   B9   C9   D9
4  NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
7  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [249]:
# if we only want the rows that appear in all dataframes
pd.concat([df1, df2, df3], join = 'inner', axis =1)

    A   B   C   D   D   E   F   G   A   D   G   H
2  A2  B2  C2  D2  A4  B4  C4  D4  A8  B8  C8  D8
3  A3  B3  C3  D3  A5  B5  C5  D5  A9  B9  C9  D9

In [250]:
pd.concat([df1, df2, df3], axis = 0) # based on row-wise concatenation, default

     A    B    C    D    E    F    G    H
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN   A4   B4   C4   D4  NaN
3  NaN  NaN  NaN   A5   B5   C5   D5  NaN
4  NaN  NaN  NaN   A6   B6   C6   D6  NaN
5  NaN  NaN  NaN   A7   B7   C7   D7  NaN
2   A8  NaN  NaN   B8  NaN  NaN   C8   D8
3   A9  NaN  NaN   B9  NaN  NaN   C9   D9
6  A10  NaN  NaN  B10  NaN  NaN  C10  D10
7  A11  NaN  NaN  B11  NaN  NaN  C11  D11

In [251]:
pd.concat([df1, df2, df3], axis = 1) # based on column-wise concatenation

     A    B    C    D    D    E    F    G    A    D    G    H
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2   A4   B4   C4   D4   A8   B8   C8   D8
3   A3   B3   C3   D3   A5   B5   C5   D5   A9   B9   C9   D9
4  NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
7  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging

In [252]:
# download our other files for the next tasks

person = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/survey_person.csv")
site = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/survey_site.csv")
survey = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/survey_survey.csv")
visited = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/survey_visited.csv")

In [253]:
person

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [254]:
site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [255]:
survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [256]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [257]:
site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [259]:
# One to one merge
visited_subset = visited.loc[[0, 2, 6]]
visited_subset

   ident   site       dated
0    619   DR-1  1927-02-08
2    734   DR-3  1939-01-07
6    837  MSK-4  1932-01-14

In [ ]:
# both the dataframes above have similar content but the content is under different names
# we can merge based on that

# if just do this, merge wont work since we dont have any common column to perform on
one2one_merge = site.merge(visited_subset)
one2one_merge

# Merge error

In [260]:
# now, name and site columns have the the same data but are set with different column names
# we use these to merge the dataframes together
one2one_merge = site.merge(visited_subset, left_on = 'name', right_on = 'site')
one2one_merge

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
2  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [261]:
# we can switch as well
one2one_merge = visited_subset.merge(site, left_on = 'site', right_on = 'name')
one2one_merge

   ident   site       dated   name    lat    long
0    619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1    734   DR-3  1939-01-07   DR-3 -47.15 -126.72
2    837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40

In [263]:
# however, we can use join to get a similar result 
# but with Nan values since site does not have index 6
one2one_join = visited_subset.join(site)
one2one_join

   ident   site       dated   name    lat    long
0    619   DR-1  1927-02-08   DR-1 -49.85 -128.57
2    734   DR-3  1939-01-07  MSK-4 -48.87 -123.40
6    837  MSK-4  1932-01-14    NaN    NaN     NaN

In [ ]:
# since visited_subset only covers [[0,2,6]] -> row 1 shows nan values for visited_subset
one2one_join = site.join(visited_subset) 
one2one_join

In [264]:
# same data but in site df, its called "name"
# in visited df, its called "site"
Many2One_merge = visited.merge(site, left_on = 'site', right_on = 'name')
Many2One_merge

   ident   site       dated   name    lat    long
0    619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1    622   DR-1  1927-02-10   DR-1 -49.85 -128.57
2    734   DR-3  1939-01-07   DR-3 -47.15 -126.72
3    735   DR-3  1930-01-12   DR-3 -47.15 -126.72
4    751   DR-3  1930-02-26   DR-3 -47.15 -126.72
5    752   DR-3         NaN   DR-3 -47.15 -126.72
6    837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40
7    844   DR-1  1932-03-22   DR-1 -49.85 -128.57

In [265]:
# Same concept as given above, we just swap the order
One2Many_merge = site.merge(visited, left_on = 'name', right_on = 'site')
One2Many_merge

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [266]:
# Manyto Many Merge
enrollment_df = pd.DataFrame({
    'ID' : [1001, 1002],
    'Course' : ["ICCS161", "ICCS161"]
})
enrollment_df

     ID   Course
0  1001  ICCS161
1  1002  ICCS161

In [267]:
exam_df = pd.DataFrame({
    "Course": ["ICCS161", "ICCS161"],
    "Exam": ["Midterm", "Final"]
})
exam_df

    Course     Exam
0  ICCS161  Midterm
1  ICCS161    Final

In [271]:
Many2Many_merge = enrollment_df.merge(exam_df)
Many2Many_merge

     ID   Course     Exam
0  1001  ICCS161  Midterm
1  1001  ICCS161    Final
2  1002  ICCS161  Midterm
3  1002  ICCS161    Final

In [269]:
enrollment_df_2 = pd.DataFrame({
    "ID": [1001, 1002, 1003],
    "Course": ["ICCS161", "ICCS161", "ICCS331"]
})
enrollment_df_2

     ID   Course
0  1001  ICCS161
1  1002  ICCS161
2  1003  ICCS331

In [272]:
# since ICCS331 is not a match in exam_df, it doesnt show up at all
Many2Many_merge_2 = enrollment_df_2.merge(exam_df)
Many2Many_merge_2

     ID   Course     Exam
0  1001  ICCS161  Midterm
1  1001  ICCS161    Final
2  1002  ICCS161  Midterm
3  1002  ICCS161    Final

In [273]:
# change the name of the index and merge on that basis
enrollment_df_2.set_index('Course', inplace = True)
enrollment_df_2

           ID
Course
ICCS161  1001
ICCS161  1002
ICCS331  1003

In [274]:
exam_df.set_index('Course', inplace = True)
exam_df

            Exam
Course
ICCS161  Midterm
ICCS161    Final

In [277]:
# since we are using "outer" , even 1003 shows up but just with a Nan value
joiney = enrollment_df_2.join(exam_df, how = 'outer')
joiney

           ID     Exam
Course
ICCS161  1001  Midterm
ICCS161  1001    Final
ICCS161  1002  Midterm
ICCS161  1002    Final
ICCS331  1003      NaN

In [278]:
# with inner, only the common values show up
joiney2 = enrollment_df_2.join(exam_df, how = 'inner')
joiney2

           ID     Exam
Course
ICCS161  1001  Midterm
ICCS161  1001    Final
ICCS161  1002  Midterm
ICCS161  1002    Final

### Conclusion - Similarities and Differences between Concat, Merge, and Join

In [279]:
df1 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/concat_1.csv")
df2 = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/concat_2.csv")

In [280]:
df3 = df2.copy()

df3.iloc[2] = df1.iloc[1]
df3.iloc[3] = df1.iloc[2]

df2.columns = ['D', 'E', 'F', 'G']
df3.columns = ['A', 'D', 'G', 'H']

df2.index=[0, 2, 3, 5]
df3.index=[2, 3, 6, 7]

In [281]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [282]:
df2

    D   E   F   G
0  A4  B4  C4  D4
2  A5  B5  C5  D5
3  A6  B6  C6  D6
5  A7  B7  C7  D7

In [283]:
df3

    A   D   G   H
2  A4  B4  C4  D4
3  A5  B5  C5  D5
6  A1  B1  C1  D1
7  A2  B2  C2  D2

In [284]:
pd.concat([df1, df2])

     A    B    C   D    E    F    G
0   A0   B0   C0  D0  NaN  NaN  NaN
1   A1   B1   C1  D1  NaN  NaN  NaN
2   A2   B2   C2  D2  NaN  NaN  NaN
3   A3   B3   C3  D3  NaN  NaN  NaN
0  NaN  NaN  NaN  A4   B4   C4   D4
2  NaN  NaN  NaN  A5   B5   C5   D5
3  NaN  NaN  NaN  A6   B6   C6   D6
5  NaN  NaN  NaN  A7   B7   C7   D7

In [285]:
pd.concat([df1, df2], axis =1)

     A    B    C    D    D    E    F    G
0   A0   B0   C0   D0   A4   B4   C4   D4
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2   A5   B5   C5   D5
3   A3   B3   C3   D3   A6   B6   C6   D6
5  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [286]:
pd.concat([df1, df2], join = 'inner')

    D
0  D0
1  D1
2  D2
3  D3
0  A4
2  A5
3  A6
5  A7

In [287]:
pd.concat([df1, df2], axis = 1, join = 'inner')

    A   B   C   D   D   E   F   G
0  A0  B0  C0  D0  A4  B4  C4  D4
2  A2  B2  C2  D2  A5  B5  C5  D5
3  A3  B3  C3  D3  A6  B6  C6  D6

In [290]:
df1.join(df2, lsuffix="_left", rsuffix="_right", how ='outer')

     A    B    C D_left D_right    E    F    G
0   A0   B0   C0     D0      A4   B4   C4   D4
1   A1   B1   C1     D1     NaN  NaN  NaN  NaN
2   A2   B2   C2     D2      A5   B5   C5   D5
3   A3   B3   C3     D3      A6   B6   C6   D6
5  NaN  NaN  NaN    NaN      A7   B7   C7   D7

In [292]:
pd.merge(df1, df2, left_index=True, right_index=True)

    A   B   C D_x D_y   E   F   G
0  A0  B0  C0  D0  A4  B4  C4  D4
2  A2  B2  C2  D2  A5  B5  C5  D5
3  A3  B3  C3  D3  A6  B6  C6  D6

In [293]:
# based on left - df1 indexes only
df1.join(df2, lsuffix="_left", rsuffix="_right", how='left')

    A   B   C D_left D_right    E    F    G
0  A0  B0  C0     D0      A4   B4   C4   D4
1  A1  B1  C1     D1     NaN  NaN  NaN  NaN
2  A2  B2  C2     D2      A5   B5   C5   D5
3  A3  B3  C3     D3      A6   B6   C6   D6

In [294]:
# based on right - df2 indexes only
df1.join(df2, lsuffix="_left", rsuffix="_right", how ='right')

     A    B    C D_left D_right   E   F   G
0   A0   B0   C0     D0      A4  B4  C4  D4
2   A2   B2   C2     D2      A5  B5  C5  D5
3   A3   B3   C3     D3      A6  B6  C6  D6
5  NaN  NaN  NaN    NaN      A7  B7  C7  D7

In [295]:
pd.merge(df1, df2, left_index=True, right_index=True, how='left')

    A   B   C D_x  D_y    E    F    G
0  A0  B0  C0  D0   A4   B4   C4   D4
1  A1  B1  C1  D1  NaN  NaN  NaN  NaN
2  A2  B2  C2  D2   A5   B5   C5   D5
3  A3  B3  C3  D3   A6   B6   C6   D6

In [296]:
pd.merge(df1, df2, left_index=True, right_index=True, how='right')

     A    B    C  D_x D_y   E   F   G
0   A0   B0   C0   D0  A4  B4  C4  D4
2   A2   B2   C2   D2  A5  B5  C5  D5
3   A3   B3   C3   D3  A6  B6  C6  D6
5  NaN  NaN  NaN  NaN  A7  B7  C7  D7

# Data Prep
- 80% of our work is data prep and 20% analysis
- wide data is more common in data analysis
- long data is easier to visualize

### 5 most common types of Untidy Data
1. column headers are values, not variable names
2. multiples variables in one column
3. variables stored in both rows and columns
4. Multiple types of observational units are stored in the same table.
5. A single observational unit is stored in multiple tables.

In [297]:
# Note: since we are using a data file on the web, we don't need to download it
df_rel = pd.read_csv('https://raw.githubusercontent.com/chendaniely/pydatadc_2018-tidy/master/data/pew.csv')

df_rel

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Dont know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [298]:
# to get info on the dataset
df_rel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   religion            18 non-null     object
 1   <$10k               18 non-null     int64
 2   $10-20k             18 non-null     int64
 3   $20-30k             18 non-null     int64
 4   $30-40k             18 non-null     int64
 5   $40-50k             18 non-null     int64
 6   $50-75k             18 non-null     int64
 7   $75-100k            18 non-null     int64
 8   $100-150k           18 non-null     int64
 9   >150k               18 non-null     int64
 10  Don't know/refused  18 non-null     int64
dtypes: int64(10), object(1)
memory usage: 1.7+ KB

In [299]:
test = pd.melt(df_rel,                           # dataset
               id_vars=['religion'],             # list of independent variables
               value_vars=['<$10k', '$10-20k'],  # list of independent variables to melt
               var_name='income',                # name of the new independent variable
               value_name = 'frequency'          # name of the new dependent variable
              )

test

                   religion   income  frequency
0                  Agnostic    <$10k         27
1                   Atheist    <$10k         12
2                  Buddhist    <$10k         27
3                  Catholic    <$10k        418
4        Dont know/refused    <$10k         15
5          Evangelical Prot    <$10k        575
6                     Hindu    <$10k          1
7   Historically Black Prot    <$10k        228
8         Jehovah's Witness    <$10k         20
9                    Jewish    <$10k         19
10            Mainline Prot    <$10k        289
11                   Mormon    <$10k         29
12                   Muslim    <$10k          6
13                 Orthodox    <$10k         13
14          Other Christian    <$10k          9
15             Other Faiths    <$10k         20
16    Other World Religions    <$10k          5
17             Unaffiliated    <$10k        217
18                 Agnostic  $10-20k         34
19                  Atheist  $10-20k         27
20                 Buddhist  $10-20k         21
21                 Catholic  $10-20k        617
22       Dont know/refused  $10-20k         14
23         Evangelical Prot  $10-20k        869
24                    Hindu  $10-20k          9
25  Historically Black Prot  $10-20k        244
26        Jehovah's Witness  $10-20k         27
27                   Jewish  $10-20k         19
28            Mainline Prot  $10-20k        495
29                   Mormon  $10-20k         40
30                   Muslim  $10-20k          7
31                 Orthodox  $10-20k         17
32          Other Christian  $10-20k          7
33             Other Faiths  $10-20k         33
34    Other World Religions  $10-20k          2
35             Unaffiliated  $10-20k        299

In [300]:
df_rel_t = pd.melt(df_rel,
                   id_vars = ['religion'],
                   value_vars = list(df_rel.columns),
                   var_name = 'income',
                   value_name = 'frequency'
                  )

df_rel_t

                  religion              income  frequency
0                 Agnostic               <$10k         27
1                  Atheist               <$10k         12
2                 Buddhist               <$10k         27
3                 Catholic               <$10k        418
4       Dont know/refused               <$10k         15
..                     ...                 ...        ...
175               Orthodox  Don't know/refused         73
176        Other Christian  Don't know/refused         18
177           Other Faiths  Don't know/refused         71
178  Other World Religions  Don't know/refused          8
179           Unaffiliated  Don't know/refused        597

[180 rows x 3 columns]

In [301]:
df_rel_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   religion   180 non-null    object
 1   income     180 non-null    object
 2   frequency  180 non-null    int64
dtypes: int64(1), object(2)
memory usage: 4.3+ KB

In [302]:
# let's clean this dataset together
df_tb = pd.read_csv("/Users/srisuphachawla/Documents/DataScienceDownloads/tb.csv")
df_tb

  country  year   m014  m1524   m2534  m3544  m4554  m5564    m65  mu   f014
0      AD  2000    0.0    0.0     1.0    0.0      0      0    0.0 NaN    NaN
1      AE  2000    2.0    4.0     4.0    6.0      5     12   10.0 NaN    3.0
2      AF  2000   52.0  228.0   183.0  149.0    129     94   80.0 NaN   93.0
3      AG  2000    0.0    0.0     0.0    0.0      0      0    1.0 NaN    1.0
4      AL  2000    2.0   19.0    21.0   14.0     24     19   16.0 NaN    3.0
5      AM  2000    2.0  152.0   130.0  131.0     63     26   21.0 NaN    1.0
6      AN  2000    0.0    0.0     1.0    2.0      0      0    0.0 NaN    0.0
7      AO  2000  186.0  999.0  1003.0  912.0    482    312  194.0 NaN  247.0
8      AR  2000   97.0  278.0   594.0  402.0    419    368  330.0 NaN  121.0
9      AS  2000    NaN    NaN     NaN    NaN      1      1    NaN NaN    NaN

In [73]:
# notice how we have a column that has all Nan values

df_tb.drop(['mu'], axis=1, inplace=True)

In [74]:
df_tb.head()

  country  year  m014  m1524  m2534  m3544  m4554  m5564   m65  f014
0      AD  2000   0.0    0.0    1.0    0.0      0      0   0.0   NaN
1      AE  2000   2.0    4.0    4.0    6.0      5     12  10.0   3.0
2      AF  2000  52.0  228.0  183.0  149.0    129     94  80.0  93.0
3      AG  2000   0.0    0.0    0.0    0.0      0      0   1.0   1.0
4      AL  2000   2.0   19.0   21.0   14.0     24     19  16.0   3.0

In [75]:
# now, we do melting
df_tb_m = pd.melt(df_tb,
                  id_vars = ['country', 'year'],
                  value_name = 'cases',
                  var_name = 'sex_and_age'
                 )
df_tb_m

   country  year sex_and_age  cases
0       AD  2000        m014    0.0
1       AE  2000        m014    2.0
2       AF  2000        m014   52.0
3       AG  2000        m014    0.0
4       AL  2000        m014    2.0
..     ...   ...         ...    ...
75      AM  2000        f014    1.0
76      AN  2000        f014    0.0
77      AO  2000        f014  247.0
78      AR  2000        f014  121.0
79      AS  2000        f014    NaN

[80 rows x 4 columns]

### 1.Split sex and age into two variables: Extract sex, age, lower bound and upper bound group

In [76]:
# extract will create 3 new columns based on our regex 
tmp_df = df_tb_m["sex_and_age"].str.extract("(\D)(\d+)(\d{2})")
tmp_df.iloc[50:60]

    0   1   2
50  m  55  64
51  m  55  64
52  m  55  64
53  m  55  64
54  m  55  64
55  m  55  64
56  m  55  64
57  m  55  64
58  m  55  64
59  m  55  64

### 2. Name the columns accordingly

In [77]:
tmp_df.columns = ['sex', 'age_lower', 'age_upper']
tmp_df

   sex age_lower age_upper
0    m         0        14
1    m         0        14
2    m         0        14
3    m         0        14
4    m         0        14
..  ..       ...       ...
75   f         0        14
76   f         0        14
77   f         0        14
78   f         0        14
79   f         0        14

[80 rows x 3 columns]

### 3. Create age column based on age-lower and age-upper

In [78]:
tmp_df['age'] = tmp_df['age_lower'] + '-' + tmp_df['age_upper']
tmp_df

   sex age_lower age_upper   age
0    m         0        14  0-14
1    m         0        14  0-14
2    m         0        14  0-14
3    m         0        14  0-14
4    m         0        14  0-14
..  ..       ...       ...   ...
75   f         0        14  0-14
76   f         0        14  0-14
77   f         0        14  0-14
78   f         0        14  0-14
79   f         0        14  0-14

[80 rows x 4 columns]

In [79]:
df_tb_m = pd.concat([df_tb_m, tmp_df], axis=1)
df_tb_m

   country  year sex_and_age  cases sex age_lower age_upper   age
0       AD  2000        m014    0.0   m         0        14  0-14
1       AE  2000        m014    2.0   m         0        14  0-14
2       AF  2000        m014   52.0   m         0        14  0-14
3       AG  2000        m014    0.0   m         0        14  0-14
4       AL  2000        m014    2.0   m         0        14  0-14
..     ...   ...         ...    ...  ..       ...       ...   ...
75      AM  2000        f014    1.0   f         0        14  0-14
76      AN  2000        f014    0.0   f         0        14  0-14
77      AO  2000        f014  247.0   f         0        14  0-14
78      AR  2000        f014  121.0   f         0        14  0-14
79      AS  2000        f014    NaN   f         0        14  0-14

[80 rows x 8 columns]

### 4. Drop unnecessary columns and rows

In [80]:
df_tb_m = df_tb_m.drop(['sex_and_age', 'age_lower', 'age_upper'], axis=1)
df_tb_m = df_tb_m.dropna()
df_tb_m

   country  year  cases sex   age
0       AD  2000    0.0   m  0-14
1       AE  2000    2.0   m  0-14
2       AF  2000   52.0   m  0-14
3       AG  2000    0.0   m  0-14
4       AL  2000    2.0   m  0-14
..     ...   ...    ...  ..   ...
74      AL  2000    3.0   f  0-14
75      AM  2000    1.0   f  0-14
76      AN  2000    0.0   f  0-14
77      AO  2000  247.0   f  0-14
78      AR  2000  121.0   f  0-14

[64 rows x 5 columns]

In [305]:
# since cases had Nan values, we would get a key error when converting it to an int
# wont be able to convert unless you drop the nan values
df_tb_m = df_tb_m.astype({'cases':'int'})
df_tb_m

   country  year  cases sex   age
0       AD  2000      0   m  0-14
1       AE  2000      2   m  0-14
2       AF  2000     52   m  0-14
3       AG  2000      0   m  0-14
4       AL  2000      2   m  0-14
..     ...   ...    ...  ..   ...
74      AL  2000      3   f  0-14
75      AM  2000      1   f  0-14
76      AN  2000      0   f  0-14
77      AO  2000    247   f  0-14
78      AR  2000    121   f  0-14

[64 rows x 5 columns]

### Now, the data looks tidy

## Missing Data

### Types of Missing Data
- **Missing completely at random (MCAR)**
  - Unrelated to both<br>a) the specific value that should have been obtained<br>**and**<br>b) the set of observed responses
    - No systematic differences exist between participants with missing data and those with complete data
  - Samples are lost accidentally or due to technical problems
  - *Pro*: Power could be lost but estimated parameters are unbiased.
  - *Con*: Don't be too fast to assume this case.
- **Missing at random (MAR)**
  - Systematically related to the observed but not the unobserved data
    - The probability that a value is missing depends on observed values of other variables
      - not on the other missing values of the target variable.
  - Example: the income level of a client can be estimated from other variables like the clients profession, experience and qualification
- **Missing not at random (MNAR)**
  - The data doesn't fit the creiteria of MCAR and MAR
  - Example: Citizens of a country opt not participate in a survey

3. Handling Missing Data

- Plan a study really carefully
  - Easier said than done
- Methods to handle missing data
  - Do nothing
  - Use only complete observaions
  - Use single imputation
  - Use multiple imputation

# Handling Missing Data  MCAR, MAR, MNAR

Missing data is a common problem in real-world datasets.  
Understanding *why* data is missing is very important because it affects:

- how we analyze data  
- whether we can safely drop rows  
- whether imputation is valid  

There are three main statistical types of missing data:

1. MCAR  Missing Completely At Random  
2. MAR  Missing At Random  
3. MNAR  Missing Not At Random  

---

## 1. MCAR  Missing Completely At Random

### Definition

Data is MCAR if the probability that a value is missing is **independent of all variables**  
(both observed and unobserved).

### Interpretation

- Missingness happens purely by chance  
- No pattern in missing values  
- Like a random accident

### Example 1  Technical Failure

A survey dataset loses some responses because:

- internet connection failed  
- a computer crashed  

These missing values are unrelated to age, gender, income, etc.

 This is MCAR.

### Example 2  Lab Accident

A researcher accidentally drops some test tubes and loses 5 samples.

- The lost samples are random  
- Not related to any measurement  

 MCAR

### Important Property

If data is MCAR:

- Dropping missing rows does **not** introduce bias  
- Simple methods like listwise deletion are acceptable  

---

## 2. MAR  Missing At Random

### Definition

Missingness depends on **observed variables**,  
but not on the actual missing value itself.

\[
P(\text{missing}) \text{ depends only on known variables}
\]

### Key Idea

We can explain the missingness using other columns in the dataset.

---

### Example 1  Income Survey

Columns collected:

- Age  
- Gender  
- Income  

Observation:

- Younger people are more likely to skip the income question

So:

- Missing income depends on AGE (which we know)

 This is MAR

---

### Example 2  Medical Study

Older patients are less likely to return for follow-up blood pressure checks.

- Age is observed  
- Missing BP depends on age  

 MAR

---

### Example 3  Education Survey

Men are less likely to answer mental health questions.

- Missingness depends on gender (observed)

 MAR

---

### Why MAR Is Important

Under MAR:

- Statistical imputation methods are usually valid  
- Methods like regression imputation or multiple imputation work well  

---

## 3. MNAR  Missing Not At Random

### Definition

Missingness depends on the **actual value that is missing**,  
even after accounting for observed variables.

\[
P(\text{missing}) \text{ depends on the missing value itself}
\]

---

### Example 1  Salary Data

People with very high salaries refuse to report income.

- The probability of missing income increases with income

 MNAR

---

### Example 2  Mental Health Survey

People with severe depression avoid answering questions about mental health.

- Missingness depends on severity of depression

 MNAR

---

### Example 3  Weight Reporting

Overweight individuals avoid reporting their weight.

- Missing weight is directly related to true weight

 MNAR

---

### Why MNAR Is Difficult

- Dropping rows causes bias  
- Simple imputation is usually incorrect  
- Often requires domain knowledge or special models  

---

# Summary Table

| Type | Depends On | Example |
|-----|-----------|---------|
| MCAR | Nothing | Random computer failure |
| MAR | Observed variables | Young people skip income |
| MNAR | The missing value itself | Rich people hide salary |

---

# Practical Consequences

| Type | Can Drop Missing Rows? | Imputation Safe? |
|-----|------------------------|-----------------|
| MCAR | Yes | Yes |
| MAR | No | Yes (with good methods) |
| MNAR | No | Very risky |

---

# Memory Trick

- **MCAR**  Pure bad luck
- **MAR**  Missing explained by other columns
- **MNAR**  Missing because of the value itself

---

# Simple Python Illustration

```python
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "age": [20, 25, 30, 35, 40],
    "income": [30000, np.nan, 50000, np.nan, 80000]
})

df

In [319]:
val1 = np.array([1,2, None ,4])
val2 = np.array([1,2, np.nan, 4])
print(val1.dtype)
print(val2.dtype)

object
float64

In [322]:
# Both of these wont work given the Nan values in the variables
val1.sum()
val2.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [327]:
# we gotta use the right function
print(np.nansum(val2))
print(np.nanmin(val2))
print(np.nanmax(val2))

7.0
1.0
4.0

In [335]:
data = pd.Series([1, np.nan, 2, None])
data2 = pd.Series(['Jim', np.nan, 'John'])

In [336]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [341]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [342]:
data2[data.notnull()]

0     Jim
2    John
dtype: object

In [360]:
x = pd.DataFrame([[1, np.nan, 2],
                 [4,5, np.nan],
                 [6,np.nan,8]])
x

y = pd.Series([1, np.nan, 3, np.nan, 8])
y
x

   0    1    2
0  1  NaN  2.0
1  4  5.0  NaN
2  6  NaN  8.0

In [350]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

data.fillna(method='ffill')
data

/var/folders/vg/vl7x2qd90x3fd40pxkwzq0tw0000gn/T/ipykernel_1106/2420585937.py:4: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [385]:
# handling missing values with SimpleInputer

from sklearn.impute import SimpleImputer

imputer = SimpleImputer(strategy = 'mean')
x_new = pd.DataFrame(imputer.fit_transform(x))
x_new

     0    1    2
0  1.0  5.0  2.0
1  4.0  5.0  5.0
2  6.0  5.0  8.0

In [355]:
# handling missing values with KNN
from sklearn.impute import KNNImputer

X = [[1, 2, np.nan],
     [3, 4, 3],
     [np.nan, 6, 5],
     [8, 8, 7]
    ]
imputer = KNNImputer(n_neighbors=2, weights="uniform")
imputer.fit_transform(X)

array([[1. , 2. , 4. ],
       [3. , 4. , 3. ],
       [5.5, 6. , 5. ],
       [8. , 8. , 7. ]])

In [373]:
x.interpolate()

   0    1    2
0  1  NaN  2.0
1  4  5.0  5.0
2  6  5.0  8.0

In [382]:
from sklearn.impute import KNNImputer

    
imputer = KNNImputer(n_neighbors=2, weights="uniform")
imputer.fit_transform(X)

array([[1. , 2. , 4. ],
       [3. , 4. , 3. ],
       [5.5, 6. , 5. ],
       [8. , 8. , 7. ]])

In [388]:
imputer = SimpleImputer(strategy = 'mean')
x_new = pd.DataFrame(imputer.fit_transform(X))
x_new

     0    1    2
0  1.0  2.0  5.0
1  3.0  4.0  3.0
2  4.0  6.0  5.0
3  8.0  8.0  7.0

In [390]:
imputer = KNNImputer(n_neighbors = 2, weights = 'uniform')
imputer.fit_transform(X)

array([[1. , 2. , 4. ],
       [3. , 4. , 3. ],
       [5.5, 6. , 5. ],
       [8. , 8. , 7. ]])

In [398]:
from sklearn.impute import SimpleImputer

imputer = SimpleImputer()
x_new = pd.DataFrame(imputer.fit_transform(X))
x_new

     0    1    2
0  1.0  2.0  5.0
1  3.0  4.0  3.0
2  4.0  6.0  5.0
3  8.0  8.0  7.0

In [401]:
from sklearn.impute import KNNImputer

imputer = KNNImputer(n_neighbors = 2, weights= 'uniform')
imputer.fit_transform(X)

array([[1. , 2. , 4. ],
       [3. , 4. , 3. ],
       [5.5, 6. , 5. ],
       [8. , 8. , 7. ]])